In [3]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned = data.dropna()

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))

In [21]:
df

          0         1         2
0  0.143031  0.943502 -0.498147
1  0.772953  1.533270 -0.213854
2  0.080093  0.715818  0.927438
3 -0.386440 -0.786098 -0.163436
4 -0.223988 -1.031571  0.392681
5 -0.499634  1.748340 -0.165257
6 -0.148783 -0.639472 -0.415078

In [22]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [23]:
df

          0         1         2
0  0.143031       NaN       NaN
1  0.772953       NaN       NaN
2  0.080093       NaN  0.927438
3 -0.386440       NaN -0.163436
4 -0.223988 -1.031571  0.392681
5 -0.499634  1.748340 -0.165257
6 -0.148783 -0.639472 -0.415078

In [24]:
df.dropna()

          0         1         2
4 -0.223988 -1.031571  0.392681
5 -0.499634  1.748340 -0.165257
6 -0.148783 -0.639472 -0.415078

In [25]:
df.dropna(thresh=2)

          0         1         2
2  0.080093       NaN  0.927438
3 -0.386440       NaN -0.163436
4 -0.223988 -1.031571  0.392681
5 -0.499634  1.748340 -0.165257
6 -0.148783 -0.639472 -0.415078

In [26]:
df.fillna(0)

          0         1         2
0  0.143031  0.000000  0.000000
1  0.772953  0.000000  0.000000
2  0.080093  0.000000  0.927438
3 -0.386440  0.000000 -0.163436
4 -0.223988 -1.031571  0.392681
5 -0.499634  1.748340 -0.165257
6 -0.148783 -0.639472 -0.415078

In [27]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  0.143031  0.500000  0.000000
1  0.772953  0.500000  0.000000
2  0.080093  0.500000  0.927438
3 -0.386440  0.500000 -0.163436
4 -0.223988 -1.031571  0.392681
5 -0.499634  1.748340 -0.165257
6 -0.148783 -0.639472 -0.415078

In [28]:
_ = df.fillna(0, inplace=True)

In [29]:
df

          0         1         2
0  0.143031  0.000000  0.000000
1  0.772953  0.000000  0.000000
2  0.080093  0.000000  0.927438
3 -0.386440  0.000000 -0.163436
4 -0.223988 -1.031571  0.392681
5 -0.499634  1.748340 -0.165257
6 -0.148783 -0.639472 -0.415078

In [30]:
df = pd.DataFrame(np.random.randn(6, 3))

In [31]:
df

          0         1         2
0  0.425012  0.201616  0.220930
1 -1.394733  1.024112  0.099532
2 -1.379362  1.870861  0.722729
3 -1.134298 -0.941390 -0.364046
4  0.975500  0.941004 -0.262544
5  1.645268  1.395923 -0.191044

In [32]:
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA

In [33]:
df

          0         1         2
0  0.425012  0.201616  0.220930
1 -1.394733  1.024112  0.099532
2 -1.379362       NaN  0.722729
3 -1.134298       NaN -0.364046
4  0.975500       NaN       NaN
5  1.645268       NaN       NaN

In [34]:
df.fillna(method='ffill')

          0         1         2
0  0.425012  0.201616  0.220930
1 -1.394733  1.024112  0.099532
2 -1.379362  1.024112  0.722729
3 -1.134298  1.024112 -0.364046
4  0.975500  1.024112 -0.364046
5  1.645268  1.024112 -0.364046

In [35]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.425012  0.201616  0.220930
1 -1.394733  1.024112  0.099532
2 -1.379362  1.024112  0.722729
3 -1.134298  1.024112 -0.364046
4  0.975500       NaN -0.364046
5  1.645268       NaN -0.364046

In [36]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [37]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [38]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [43]:
data = pd.DataFrame({'k1':['one', 'two'] * 3 + ['two'], 'k2': [1,1,2,3,3,4,4]})

In [44]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [45]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [46]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [47]:
data['v1']=range(7)

In [48]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [49]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [50]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [51]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [52]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [55]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [56]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])

In [58]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [64]:
tranform = lambda x: x[:4].upper()

In [65]:
data.index.map(tranform)

array(['OHIO', 'COLO', 'NEW '], dtype=object)

In [66]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [67]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [68]:
bins = [18, 25, 35, 60, 100]

In [69]:
cats = pd.cut(ages, bins)

In [70]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [71]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [72]:
cats.categories

Index(['(18, 25]', '(25, 35]', '(35, 60]', '(60, 100]'], dtype='object')

In [73]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [74]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, object): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [75]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged','Senior']

In [76]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [77]:
data = np.random.rand(20)

In [78]:
pd.cut(data, 4, precision=2)

[(0.73, 0.97], (0.73, 0.97], (0.24, 0.49], (0.49, 0.73], (0.49, 0.73], ..., (0.49, 0.73], (0.24, 0.49], (0.0028, 0.24], (0.24, 0.49], (0.24, 0.49]]
Length: 20
Categories (4, object): [(0.0028, 0.24] < (0.24, 0.49] < (0.49, 0.73] < (0.73, 0.97]]

In [79]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [80]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004450     0.015334    -0.035373     0.044956
std       1.006088     0.989298     0.974816     0.999159
min      -3.331743    -2.711301    -2.858578    -3.142832
25%      -0.703051    -0.647239    -0.742206    -0.632944
50%      -0.012059    -0.010370     0.011302     0.009878
75%       0.697599     0.717260     0.635874     0.711596
max       3.119289     3.161285     3.462557     2.948150

In [81]:
col = data[2]

In [82]:
col[np.abs(col) > 3]

353    3.462557
543    3.079553
666    3.042569
Name: 2, dtype: float64

In [83]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
104 -0.863642 -0.220945 -1.310964 -3.142832
274  3.119289  1.005130  0.817216 -0.259422
353  0.180196  0.084635  3.462557 -0.052084
543  0.699211 -0.461004  3.079553  0.617461
595  0.739218  3.161285 -1.080820 -1.898631
666 -0.105162  1.452386  3.042569  0.845457
846 -3.034855 -1.264680 -1.643433 -2.124719
912 -3.331743 -0.495033 -0.914786 -0.531968
925 -0.768352  3.032484  1.213221 -0.747753

In [84]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [85]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004697     0.015140    -0.035958     0.045099
std       1.004573     0.988699     0.972877     0.998713
min      -3.000000    -2.711301    -2.858578    -3.000000
25%      -0.703051    -0.647239    -0.742206    -0.632944
50%      -0.012059    -0.010370     0.011302     0.009878
75%       0.697599     0.717260     0.635874     0.711596
max       3.000000     3.000000     3.000000     2.948150

In [86]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [87]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [88]:
sampler = np.random.permutation(5)

In [89]:
sampler

array([3, 0, 4, 2, 1])

In [90]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [91]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7

In [92]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19

In [93]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [94]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [95]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [96]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [97]:
df_with_dummy = df[['data1']].join(dummies)

In [98]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [99]:
val = 'a, b, guido'

In [100]:
val.split(',')

['a', ' b', ' guido']

In [101]:
pieces = [x.strip() for x in val.split(',')]

In [102]:
pieces

['a', 'b', 'guido']

In [103]:
first, second, third = pieces

In [104]:
'::'.join(pieces)

'a::b::guido'

In [105]:
'guido' in val

True

In [106]:
val.index(',')

1

In [107]:
val.count(',')

2

In [108]:
import re

In [109]:
text = "foo bar\t baz \tqux"

In [110]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [111]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [112]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [113]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [114]:
data = {'Dave': 'dave@google.com', 'Steve':'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [115]:
data = pd.Series(data)

In [116]:
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [117]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [118]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [119]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [120]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [dave@google.com]
Rob        [rob@gmail.com]
Steve    [steve@gmail.com]
Wes                    NaN
dtype: object